1. How to import pandas and check the version?

In [2]:
import pandas as pd
pd.__version__

'1.0.1'

2. How to create a series from a list, numpy array and dict?

In [4]:
import numpy as np 
mylist = list('abcedfghijklmnopqrstuvwxyz') 
myarr = np.arange(26) 
mydict = dict(zip(mylist, myarr))

In [26]:
s1 = pd.Series(mylist)

In [22]:
s2 = pd.Series(myarr)

In [23]:
s3 = pd.Series(mydict)

3. How to convert the index of a series into a column of a dataframe?

In [20]:
df = pd.DataFrame({'Roll Number': ['101', '102', '103', '104'], 
                   'Name': ['Hari', 'Balu', 'Manju', 'Raju'], 
                   'Marks In Percentage': [97, 90, 70, 82], 
                   'Grade': ['A', 'A', 'C', 'B'], 
                   'Subject': ['Physics', 'Physics', 'Physics', 'Physics']},) 
df['index'] = df.index 
df

  Roll Number   Name  Marks In Percentage Grade  Subject  index
0         101   Hari                   97     A  Physics      0
1         102   Balu                   90     A  Physics      1
2         103  Manju                   70     C  Physics      2
3         104   Raju                   82     B  Physics      3

4. How to combine many series to form a dataframe?

In [27]:
df1 = pd.concat([s1, s2, s3],axis=1)
df1

      0     1     2
0     a   0.0   NaN
1     b   1.0   NaN
2     c   2.0   NaN
3     e   3.0   NaN
4     d   4.0   NaN
5     f   5.0   NaN
6     g   6.0   NaN
7     h   7.0   NaN
8     i   8.0   NaN
9     j   9.0   NaN
10    k  10.0   NaN
11    l  11.0   NaN
12    m  12.0   NaN
13    n  13.0   NaN
14    o  14.0   NaN
15    p  15.0   NaN
16    q  16.0   NaN
17    r  17.0   NaN
18    s  18.0   NaN
19    t  19.0   NaN
20    u  20.0   NaN
21    v  21.0   NaN
22    w  22.0   NaN
23    x  23.0   NaN
24    y  24.0   NaN
25    z  25.0   NaN
a   NaN   NaN   0.0
b   NaN   NaN   1.0
c   NaN   NaN   2.0
d   NaN   NaN   4.0
e   NaN   NaN   3.0
f   NaN   NaN   5.0
g   NaN   NaN   6.0
h   NaN   NaN   7.0
i   NaN   NaN   8.0
j   NaN   NaN   9.0
k   NaN   NaN  10.0
l   NaN   NaN  11.0
m   NaN   NaN  12.0
n   NaN   NaN  13.0
o   NaN   NaN  14.0
p   NaN   NaN  15.0
q   NaN   NaN  16.0
r   NaN   NaN  17.0
s   NaN   NaN  18.0
t   NaN   NaN  19.0
u   NaN   NaN  20.0
v   NaN   NaN  21.0
w   NaN   NaN  22.0
x   NaN   NaN  23.0
y   NaN   NaN  24.0
z   NaN   NaN  25.0

5. How to assign name to the series’ index?

In [30]:
s4 = pd.Series(np.arange(10))
s4

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

In [31]:
s4.rename_axis("Index")

Index
0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int32

6. How to get the items of series A not present in series B?

In [36]:
s_A = pd.Series(np.arange(10,25))
s_B = pd.Series(np.arange(20,30))
s7 = pd.Series(np.intersect1d(s_A,s_B))
s7

0    20
1    21
2    22
3    23
4    24
dtype: int32

7. How to get the items not common to both series A and series B?

In [40]:
s8 = s_A[~s_A.isin(s_B)]
s8

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

8. How to get the minimum, 25th percentile, median, 75th, and max of a numeric series?

In [42]:
s_A.min()

10

In [43]:
s_A.max()

24

In [45]:
s_A.quantile(0.25)

13.5

In [46]:
s_A.quantile(0.75)

20.5

9. How to get frequency counts of unique items of a series?

In [62]:
s9 = pd.Series([1,2,4,5,2,5,6,8,8,1,2,3,4,5,5,6,7,8,8,9,7])
s9.value_counts()

8    4
5    4
2    3
7    2
6    2
4    2
1    2
9    1
3    1
dtype: int64

10. How to keep only top 2 most frequent values as it is and replace everything else as ‘Other’?

In [63]:
print(s9.value_counts().nlargest(2))

8    4
5    4
dtype: int64

In [64]:
res=s9[~s9.isin(s9.value_counts().nlargest(2))]='Other'
s9

0     Other
1     Other
2         4
3     Other
4     Other
5     Other
6     Other
7     Other
8     Other
9     Other
10    Other
11    Other
12        4
13    Other
14    Other
15    Other
16    Other
17    Other
18    Other
19    Other
20    Other
dtype: object

11. How to bin a numeric series to 10 groups of equal size?

In [76]:
s10 = pd.Series(np.arange(20))
s10

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
dtype: int32

In [77]:
pd.qcut(s10,q=10)

0     (-0.001, 1.9]
1     (-0.001, 1.9]
2        (1.9, 3.8]
3        (1.9, 3.8]
4        (3.8, 5.7]
5        (3.8, 5.7]
6        (5.7, 7.6]
7        (5.7, 7.6]
8        (7.6, 9.5]
9        (7.6, 9.5]
10      (9.5, 11.4]
11      (9.5, 11.4]
12     (11.4, 13.3]
13     (11.4, 13.3]
14     (13.3, 15.2]
15     (13.3, 15.2]
16     (15.2, 17.1]
17     (15.2, 17.1]
18     (17.1, 19.0]
19     (17.1, 19.0]
dtype: category
Categories (10, interval[float64]): [(-0.001, 1.9] < (1.9, 3.8] < (3.8, 5.7] < (5.7, 7.6] ... (11.4, 13.3] < (13.3, 15.2] < (15.2, 17.1] < (17.1, 19.0]]

12. How to convert a numpy array to a dataframe of given shape? Reshape the series ser into a dataframe with 7 rows and 5 columns

In [78]:
ser = pd.Series(np.random.randint(1, 10, 35))

In [80]:
pd.DataFrame(ser.values.reshape(7,5))

   0  1  2  3  4
0  7  6  9  1  6
1  3  4  3  9  7
2  4  8  3  3  5
3  5  1  6  8  2
4  2  8  4  6  8
5  8  5  4  2  4
6  3  4  4  5  9

13. How to find the positions of numbers that are multiples of 3 from a series?

In [91]:
s11 = pd.Series([1,3,4,5,6,5,6,8,8,1,9,3,4,15,5,6,7,18,8,9,27])
s11.where(lambda x: x%3 == 0).dropna()

1      3.0
4      6.0
6      6.0
10     9.0
11     3.0
13    15.0
15     6.0
17    18.0
19     9.0
20    27.0
dtype: float64

14.  How to extract items at given positions from a series?

In [92]:
# From ser, extract the items at positions in list pos. 
ser = pd.Series(list('abcdefghijklmnopqrstuvwxyz')) 
pos = [0, 4, 8, 14, 20] 
ser.loc[pos]

0     a
4     e
8     i
14    o
20    u
dtype: object

15. How to stack two series vertically and horizontally ?

In [99]:
s12 = pd.Series(np.arange(0,5))
s13 = pd.Series(np.arange(5,10))

In [102]:
# Vertical Stack
pd.concat([s12, s13], axis = 0)

0    0
1    1
2    2
3    3
4    4
0    5
1    6
2    7
3    8
4    9
dtype: int32

In [106]:
# Horizontal Stack
pd.concat([s12, s13], axis = 1)

   0  1
0  0  5
1  1  6
2  2  7
3  3  8
4  4  9

16. How to convert the first character of each element in a series to uppercase?

In [105]:
ser = pd.Series(['how', 'to', 'kick', 'ass?'])
pd.Series([item.title() for item in ser])

0     How
1      To
2    Kick
3    Ass?
dtype: object

17. How to calculate the number of characters in each word in a series?

In [115]:
ser = pd.Series(['how', 'to', 'learn', 'pandas?']) 
pd.concat([ser,pd.Series([len(i) for i in ser])],axis=1)

         0  1
0      how  3
1       to  2
2    learn  5
3  pandas?  7

18. How to convert a series of date-strings to a timeseries?

In [116]:
ser = pd.Series(['01 Jan 2010', '02-02-2011', '20120303', '2013/04/04', '2014-05-05', '2015-06-06T12:20']) 
ser

0         01 Jan 2010
1          02-02-2011
2            20120303
3          2013/04/04
4          2014-05-05
5    2015-06-06T12:20
dtype: object

In [117]:
pd.to_datetime(ser)

0   2010-01-01 00:00:00
1   2011-02-02 00:00:00
2   2012-03-03 00:00:00
3   2013-04-04 00:00:00
4   2014-05-05 00:00:00
5   2015-06-06 12:20:00
dtype: datetime64[ns]